tap "basicmachines-co/basic-memory"
tap "bufbuild/buf"
tap "homebrew/cask"
tap "homebrew/core"
tap "minamijoyo/tfupdate"
# Run your GitHub Actions locally
brew "act"
# Code searching, linting, rewriting
brew "ast-grep"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 4.2+
brew "bash-completion@2"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# New way of working with Protocol Buffers
brew "buf"
# Linter/analyzer for Makefiles
brew "checkmake"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# Prevent cloud misconfigurations during build-time for IaC tools
brew "checkov"
# Enables you to reproduce the CircleCI environment locally
brew "circleci"
# Utility for connecting securely to your Cloud SQL instances
brew "cloud-sql-proxy"
# Conventional Commits toolbox
brew "cocogitto"
# Container Signing
brew "cosign"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Tool for exploring each layer in a docker image
brew "dive"
# Lightning-fast linter for .env files written in Rust
brew "dotenv-linter"
# More expressive universal gRPC client
brew "evans"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Simple gRPC benchmarking and load testing tool
brew "ghz"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Quickly rewrite git repository history
brew "git-filter-repo"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Interactive web UI for gRPC, along the lines of postman
brew "grpcui"
# Like cURL, but for gRPC
brew "grpcurl"
# Kubernetes package manager
brew "helm"
# Kubernetes package manager
brew "helm@3"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Calculate various network masks, etc. from a given IP address
brew "ipcalc"
# Sort Python imports automatically
brew "isort"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Little helper to run CNCF's k3s in Docker
brew "k3d"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Package manager for kubectl plugins
brew "krew"
# SDK for building Kubernetes APIs using CRDs
brew "kubebuilder"
# FAST Kubernetes manifests validator, with support for Custom Resources!
brew "kubeconform"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Input filter for the pager less
brew "lesspipe"
# Postgres C API library
brew "libpq"
# Utility for directing compilation
brew "make"
# MCP server for databases
brew "mcp-toolbox"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# CLI tool to help discover deprecated apiVersions in Kubernetes
brew "pluto"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Wrapper to colorize and simplify ping's output
brew "prettyping"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Show ps output as a tree
brew "pstree"
# Password generator
brew "pwgen"
# Easily download, build, install, upgrade, and uninstall Python packages
brew "python-setuptools"
# Persistent key-value database, with built-in net interface
brew "redis"
# GNU Make with improved error handling, tracing, and a debugger
brew "remake"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# SSH server & client auditing
brew "ssh-audit"
# Cross-shell prompt for astronauts
brew "starship"
# Secrets management tool for developers
brew "teller"
# User interface to the TELNET protocol
brew "telnet"
# OpenTofu / Terraform / Terragrunt / Terramate / Atmos version manager
brew "tenv"
# MCP server for Terraform
brew "terraform-mcp-server"
# Linter for Terraform files
brew "tflint"
# Fast text search tool (ripgrep)
brew "ripgrep"
# Define your dev environment as code. For microservice apps on Kubernetes
brew "tilt"
# Terminal multiplexer
brew "tmux"
# Tmux session manager. Built on libtmux
brew "tmuxp"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# File synchronization tool
brew "unison"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Vi 'workalike' with many additional features
brew "vim"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Command-line client for WebSockets
brew "websocat"
# Internet file retriever
brew "wget"
# Homebrew, but with Docker images
brew "whalebrew"
# Linter for YAML files
brew "yamllint"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Zsh plugin manager
brew "zimfw"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Additional completion definitions for zsh
brew "zsh-completions"
# AI-powered knowledge management system with MCP server integration
brew "basicmachines-co/basic-memory/basic-memory"
# Update version constraints in your Terraform / OpenTofu configurations
brew "minamijoyo/tfupdate/tfupdate"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Chromium based browser
cask "arc"
# Desktop password and login vault
cask "bitwarden"
# Monitors common persistence locations
cask "blockblock"
# Utility to export your existing Cloudflare resources as Terraform resources
cask "cf-terraforming"
# Web debugging Proxy application
cask "charles"
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal-based AI coding assistant
cask "claude-code"
# Dynamic Island-style notifications for Claude Code CLI sessions
cask "claude-island"
# Write, edit, and chat about your code with AI
cask "cursor"
# Universal database tool and SQL client
cask "dbeaver-community"
# Voice and text chat software
cask "discord"
# Web browser
cask "firefox"
cask "font-iosevka-nerd-font"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Testing client for REST, GraphQL, and HTTP APIs
cask "httpie-desktop"
# HTTP and GraphQL Client
cask "insomnia"
# Daily planner and focus timer
cask "locu"
# Privacy-first, open-source platform for knowledge sharing and management
cask "logseq"
# Detailed information on every Apple product ever made
cask "mactracker"
# Modern GUI for Redis
cask "medis"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Replacement for Docker Desktop
cask "orbstack"
# Extract files and folders from package files, disk images, and archives
cask "pacifist"
# Team communication and collaboration software
cask "slack"
# OpenSpec document management desktop app
cask "spectra-app"
# Open-source code editor
cask "visual-studio-code"
# Multiplayer code editor
cask "zed"
# Redis GUI built with Rust and GPUI
cask "zedis"
vscode "apollographql.vscode-apollo"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "circleci.circleci"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "earthly.earthfile-syntax-highlighting"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "mgmcdermott.vscode-language-babel"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.makefile-tools"
vscode "nize.oklch-preview"
vscode "njpwerner.autodocstring"
vscode "nrwl.angular-console"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "ryu1kn.partial-diff"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "tilt-dev.tiltfile"
vscode "timonwong.shellcheck"
vscode "unifiedjs.vscode-mdx"
vscode "vitest.explorer"
vscode "vscodevim.vim"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
uv "poetry"
krew "datadog"
krew "resource-capacity"
